In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [3]:
%%sql
select * from test.sales

 * mysql+mysqlconnector://tushar:***@localhost
3 rows affected.

   product_id period_start  period_end  average_daily_sales
0           1   2019-01-25  2019-02-28                  100
1           2   2018-12-01  2020-01-01                   10
2           3   2019-12-01  2020-01-31                    1

In [15]:
%%sql
set session cte_max_recursion_depth=10000;

 * mysql+mysqlconnector://tushar:***@localhost
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [23]:
%%sql
with recursive date_loop (min_date, max_date) as(
select min(period_start) as min_date,
    max(period_end) as max_date
from test.sales
union all
select date_add(min_date, interval 1 day) as min_date, max_date
from date_loop
    where min_date < max_date
)
select product_id, year(min_date) as year, sum(average_daily_sales) as sales from test.sales s
inner join date_loop dl
where dl.min_date>=period_start and dl.min_date<=period_end
group by product_id, year

 * mysql+mysqlconnector://tushar:***@localhost
6 rows affected.

   product_id  year sales
0           2  2018   310
1           2  2019  3650
2           1  2019  3500
3           3  2019    31
4           3  2020    31
5           2  2020    10

In [24]:
%%sql
WITH RECURSIVE 
odd_no (sr_no, n) AS
(
SELECT 1, 1 
union all
SELECT sr_no+1, n+2 from odd_no where sr_no < 5 
)
SELECT * FROM odd_no;

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

   sr_no  n
0      1  1
1      2  3
2      3  5
3      4  7
4      5  9